In [162]:
def call1(a,b,c):
    print(a,b,c)
    
call1(10,20,30) #위치 매개변수

10 20 30

In [163]:
def call2(a,b,c=50):
    print(a,b,c)
call2(10,20,30)

10 20 30

In [164]:
call2(10,20) #default 기본 매개변수

10 20 50

In [165]:
#default 매개변수는 반드시 뒤에다 위치시켜야 한다. 
#def call3(a=10,b,c) ##오류!
def call3(a, b = 50, c = 100):
    print(a,b,c)

In [166]:
call3(10)

10 50 100

In [167]:
def call4(a,b,c):
    print(a,b,c)

In [168]:
call4(a=100, c =200, b = 333) #키워드 파라미터, 순서 상관 x

100 333 200

In [169]:
##파이썬은 오버라이딩은 지원o, 오버로딩은 지원x 
##오버라이딩(재정의): 상속했을 떄 
#자식 클래스의 함수를 재정의하여 기능을 변경 
#오버로딩(다형성): 하나의 이름으로 다양한 형태를 구현할 수 있는 기능 
#자바는 하나의 함수 이름으로 다양한 입력값의 형태를 정의할 수 있다 
#자바는 오버로딩 가능 
#public void add(int x, int y)
#public void add(int x)
#파이썬은 오버로딩 불가능 
#입력값으로 튜플과 딕셔너리를 여러 개 넣을 수 있기 때문에 
#파이썬의 함수 입력값은 0~무한대의 개수를 가지게 정의할 수 있다. 
#가변 매개변수라고 부른다.

In [170]:
def call5(*a,b):
    print(a)
    print(b)

In [171]:
def call6(*a):
    print(a)

In [172]:
#python.exe프로그램이 한 줄을 읽어서 실행을 바로 해준다 
#번역기

In [173]:
call5((1,2,3),b = 5)#위치가변매개변수는 단독으로 많이 쓰임 
#위치 가변 매개변수를 쓸 때는 다른 매개변수는 
#키워드를 파라미터명을 반드시 써주어야 
#헷갈리지 않는다.

((1, 2, 3),)
5

In [174]:
call6(1,2,3,4,5)#shift+tab을 누르면 함수의 원형이 나온다. 
                #a라는 변수에 다 들어가 있구나라는 것을 알 수 있다. 
                #파이썬은 가변적이기 떄문에 반드시 확인해봐야 한다. 
                #파이썬에서는 파라미터의 개수가 정확히 몇개인지 확인하려면 
                #함수의 정의를 보고 확인해야한다.(shitf+tab)

(1, 2, 3, 4, 5)

In [175]:
call6((1,2,3,4,5),(6,7,8))#위치 가변 매개변수는 튜플의 튜플도 가능

((1, 2, 3, 4, 5), (6, 7, 8))

In [176]:
call6((1,2,3,4,5),{'name':'hong'})
#위치 가변매개변수는 혼합된 형태도 가능 
#무조건 입력값을 튜플로 묶음.

((1, 2, 3, 4, 5), {'name': 'hong'})

In [177]:
def call7(**kwargs): #키워드 가변 매개변수 
    print(kwargs)

In [178]:
call7(name='hong',age=100)

{'name': 'hong', 'age': 100}

In [179]:
call7(name='hong')

{'name': 'hong'}

In [180]:
call7(name = 'hong', age = 100, tel = '010')

{'name': 'hong', 'age': 100, 'tel': '010'}

In [181]:
def call8(*tags, title, content, **kwargs):
    print('tag>>', tags)
    print('title>>', title)
    print('content>>', content)
    print('kwargs>>', kwargs)

In [182]:
##가변변수와 ㅎ마께 쓰는 일반변수는 키워드변수로 사용해야한다.
#변수명과 함께 써주어야 한다.

In [183]:
call8('바다','휴양지','쉼',
      title = '제주도여행',
      content = '해수욕장으로 고고', 
      location = '제주도 북동부', 
      move = '날아서'
     )

tag>> ('바다', '휴양지', '쉼')
title>> 제주도여행
content>> 해수욕장으로 고고
kwargs>> {'location': '제주도 북동부', 'move': '날아서'}

In [184]:
##람다 함수

In [185]:
def call9(a): 
    b = a-1
    return b

In [186]:
#일반 함수의 4대 조건 
#함수이름(입력값): call9(a)
#함수 처리 내용(a-1)
#함수 처리 결과 리턴값(b)

#람다 함수의 3대 조건 
#(입력값): 
#함수 처리내용
#함수 처리 결과 리턴값

In [187]:
#[list comprehension] =>익명함수의 일종

In [188]:
#lambda 익명함수의 일종 
lambda a : a-1

In [189]:
(lambda a : a-1)(10)

9

In [190]:
a_fun = lambda a: a-1

In [191]:
a_fun(10) #보통은 지역변수로만 쓰고 버린다. 
            #메모리를 차지하지 않는다.

9

In [192]:
lambda a : True if a > 0 else False

In [193]:
(lambda a : True if a > 0 else False)(10) #else도 함께 써주어야 함.

True

In [194]:
#입력값이 양수이면 1, 음수이면 0

In [195]:
lambda a : 1 if a>0 else 0

In [196]:
(lambda a : 1 if a>0 else 0)(10)

1

In [197]:
fun_a= lambda a : 1 if a>0 else 0

In [198]:
(fun_a)(10)

1

In [199]:
ab_fun = lambda a,b : a+ b

In [200]:
ab_fun(10,20)

30

In [201]:
a_list = [1,2,3]
b_list = [4,5,6]
ab_fun(a_list,b_list)

[1, 2, 3, 4, 5, 6]

In [202]:
one_fun = lambda x : 1 if x>0 else 0

In [203]:
one_fun(100)

1

In [204]:
one_fun2 = lambda x : '양수' if x>0 else '음수'

In [205]:
one_fun2(100)

'양수'

In [206]:
def one_fun(x):
    if x>0:
        return 1
    else:
        return 0

In [207]:
def one_func2(x):
    if(x>0):
        print('양수')
    else:
        print('음수')
one_func2(100)

양수

In [208]:
ab_fun = lambda a, b : a+b

In [209]:
#def ab_fun(a,b):
#    return a+b

In [210]:
result2 = ab_fun(10,20)
result2

30

In [211]:
a_list = [1,2,3]
b_list = [4,5,6]
ab_fun(a_list, b_list)

[1, 2, 3, 4, 5, 6]

In [212]:
#데이터분석에 있어서 핵심은 df(데이터프레임)
#람다를 df를 다룰 때 어떻게 사용해야 하는가?

In [213]:
#람다함수를 사용하는 이유 
#1. 메모리에 함수의 원형이 저장되지 않음 
#2. 일반 함수보다 쉽고 간단

In [214]:
lambda x : x+1 #lambda 입력파라메터리스트 : 처리내용(반환)

In [215]:
list_data2 = [10,20,-30,-40,50]
positive_negative = lambda x: '양수' if x>0 else '음수'
list(map(positive_negative, list_data2))

['양수', '양수', '음수', '음수', '양수']

In [216]:
result_pn = list(map(positive_negative, list_data2))
result_pn

['양수', '양수', '음수', '음수', '양수']

In [217]:
name_lambda = lambda x:1 if '홍' in x else 0 #홍이 홍길동에 있으면 1 없으면 0

In [218]:
name_result = list(map(name_lambda, df1['name']))
name_result

[1, 0, 1, 0, 0]

In [219]:
'홍' in '홍길동' #오른쪽에는 많은 것이 옴 #in 문자열, in의 결과는 Bool

True

In [220]:
1 in [1,2,3] #in 리스트, 리스트내에 1을 포함하는지 여부 확인

True

In [221]:
1 not in [1,2,3]

False

In [222]:
###참석 확인하려고 하는 이름이 '홍길동'
###참석자리스트가 '김길동', '박길동', '송길동'
###포함여부 확인용 ==> in , not in

In [223]:
'홍길동' in ['김길동','박길동','송길동'] #in은 포함여부를 나타내는 것.

False

In [224]:
name_list = ['김길동','박길동','송길동']
name = input('확인하고 싶은 이름을 입력하세요.')

확인하고 싶은 이름을 입력하세요.홍

In [225]:
if name in name_list: 
    print('참석자 명단에 있습니다.')
else:
    print('참석자 명단에 없습니다 ')

참석자 명단에 없습니다

In [226]:
#일반 함수와 람다함수로 이름을 넣어서 판단하는 처리를 구현해보세요.

In [227]:
def name_test(x): 
    if x in name_list: 
        print('참석자 명단에 있습니다.')
    else:
        print('참석자 명단에 없습니다 ')
name_test('홍')

참석자 명단에 없습니다

In [228]:
'홍길동'.find('홍')

0

In [229]:
'홍길동'.find('정')

-1

In [230]:
lambda x : x + 1

In [231]:
(lambda x: x+1)(10)

11

In [232]:
add = lambda x : x+ 1

In [233]:
add(100), add(111)

(101, 112)

In [234]:
list_data = [1,2,3]

In [235]:
list(map(add, list_data)) #map이라는 함수는 ampping이라는 의미 list_data를 하나하나씩 꺼내서 
                          #add라는 함수를 적용시켜서 mapping을 시킨다는 의미 .
                          #ampping을 시켜줬기 때문에 결과가 list지만 map함수는 map객체로 만듦.
                          #list가 아니고 객체이다 보니 쓸 수 없는 형태로 나와서 캐스팅해줘야함. 
                          #map함수는 많은 양의 데이터(ex)리스트)를 하나씩 꺼내서 함수를 map시켜 실행시켜준다. 
                          #map함수의 결과는 무조건 map 
                          #map함수의 결과를 사용하고자 하는 경우, list로 캐스팅 시켜준다.

[2, 3, 4]

In [236]:
import numpy as np 
import pandas as pd

In [237]:
df1=pd.DataFrame({
    'name': ['홍길동', '김길동', '홍순신', '정길동', '정사임'], 
    'age' : [100,200,300,150,250]
})
df1

  name  age
0  홍길동  100
1  김길동  200
2  홍순신  300
3  정길동  150
4  정사임  250

In [238]:
df1['result'] = result_pn

In [239]:
df1

  name  age result
0  홍길동  100     양수
1  김길동  200     양수
2  홍순신  300     음수
3  정길동  150     음수
4  정사임  250     양수

In [240]:
age_lambda = lambda x : '고령' if x>=200 else '보통'

In [241]:
age_list= list(map(age_lambda, df1['age']))

In [242]:
df1['age_result'] = age_list
df1

  name  age result age_result
0  홍길동  100     양수         보통
1  김길동  200     양수         고령
2  홍순신  300     음수         고령
3  정길동  150     음수         보통
4  정사임  250     양수         고령

In [243]:
#람다함수를 만들어보세요 
#name에 '홍'이라는 글자를 포함하고 있으면 1, 아니면 0 
on_lambda = lambda x : '참석자 명단에 있습니다.' if x in name_list else '참석자 명단에 없습니다'
on_lambda('홍길동')
#결과를 name_result 파생변수를 만들어보세요

'참석자 명단에 없습니다'

In [244]:
name_result = list(map(name_lambda, df1['name']))
name_result

[1, 0, 1, 0, 0]

In [245]:
df1['name_result'] = name_result
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     양수         고령            0
2  홍순신  300     음수         고령            1
3  정길동  150     음수         보통            0
4  정사임  250     양수         고령            0

In [246]:
name_result2 = list(filter(name_lambda, df1['name']))
name_result2

#map은 true이면 이거 false이면 이거해서 둘 다 가져오고 
#filter는 '홍'이 포함된 것만 가져옴. 
#map은 true이든 false이든 return을 모두 다 가져오고 
#

['홍길동', '홍순신']

In [247]:
#df의 result 변수의 값이 양수이면 1, 음수이면 0으로 바꿔보세요

In [248]:
#age_result 값이 고령이면 1, 아니면 0으로 변경해보세요 
#age를 100~200 => 0, 200 ~ 250 => 1 , 나머지는 2 

def age_func(x): 
    if 100<=x<200:
        return 0 #map 함수 내에 사용할 함수는 return을 명시해야 함. 
    elif 200<=x<250:
        return 1
    else: 
        return 2

In [249]:
age_func_result = list(map(age_func, df1['age']))

In [250]:
age_func_result

[0, 1, 2, 0, 2]

In [251]:
age_result_lambda = lambda x: 1 if x == '고령' else 0

In [252]:
def age_result_func(x):
    if x == '고령': 
        return 1
    else: 
        return 0

In [254]:
#df1['age_result'] = list(map(age_result_lambda, df1[age_result]))
#df1

In [256]:
df1.columns

Index(['name', 'age', 'result', 'age_result', 'name_result'], dtype='object')

In [258]:
df1['age'].apply(lambda x : x+1)

0    101
1    201
2    301
3    151
4    251
Name: age, dtype: int64

In [259]:
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     양수         고령            0
2  홍순신  300     음수         고령            1
3  정길동  150     음수         보통            0
4  정사임  250     양수         고령            0

In [260]:
##일반함수를 만들어 apply를 적용해보세요 
#이름의 첫글자가 송으로 시작하면 '송' 아니면 첫글자에 해당하는 글자 
##파생변수 name_apply

result_name = []
for x in df1['name']
    if x[0] == '송':
        result_name.append('송')
    else:
        result_name.append(x[0])
    result_name

SyntaxError: invalid syntax (4270551626.py, line 6)

In [262]:
df = pd.read_csv('../csv-data/titanic_train.csv')
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,2,1,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,3,1,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,3,0,"Davies, Mr. Joseph",male,17.0,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI"
894,3,0,"Lockyer, Mr. Edward",male,NaN,0,0,1222,7.8792,NaN,S,153.0,NaN
895,1,0,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,3,1,"Dorking, Mr. Edward Arthur",male,19.0,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL"
897,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [263]:
#p-class column upadte => 1: low 2-3: middle, 4-5: high

In [294]:
df2 = pd.read_csv('../csv-data/titanic_train.csv')
df2

def p_class_mdfy(x):
    if x == 1:
        return 'low'
    elif x == 2 or x==3:
        return 'middle'
    else:
        return 'high' 
df2['pclass'] = df2['pclass'].apply(p_class_mdfy)
# df[pclass]  = p_class_mdfy(df['pclass'])   
df2

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,middle,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,middle,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,middle,1,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,middle,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,middle,1,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,middle,0,"Davies, Mr. Joseph",male,17.0,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI"
894,middle,0,"Lockyer, Mr. Edward",male,NaN,0,0,1222,7.8792,NaN,S,153.0,NaN
895,low,0,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,middle,1,"Dorking, Mr. Edward Arthur",male,19.0,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL"
897,low,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [295]:
df2 = pd.read_csv('../csv-data/titanic_train.csv')
df2

def str_count(x):
    if len(x)>15:
        return 'long'
    else:
        return 'short'

    
df2['name_result'] = df2['name'].apply(str_count)
df2

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest,name_result
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT",long
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH",long
2,2,1,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba",long
3,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN,long
4,3,1,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls...",long
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,3,0,"Davies, Mr. Joseph",male,17.0,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI",long
894,3,0,"Lockyer, Mr. Edward",male,NaN,0,0,1222,7.8792,NaN,S,153.0,NaN,long
895,1,0,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB",long
896,3,1,"Dorking, Mr. Edward Arthur",male,19.0,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL",long
897,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA",long

In [277]:
def survive_mdfy(x):
    if x == 1:
        return '생존'
    elif x == 0:
        return '사망'
df['survived'] = df['survived'].apply(survive_mdfy)
# df[pclass]  = p_class_mdfy(df['pclass'])   
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,high,생존,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,high,생존,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,high,생존,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,high,사망,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,high,생존,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,high,사망,"Davies, Mr. Joseph",male,17.0,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI"
894,high,사망,"Lockyer, Mr. Edward",male,NaN,0,0,1222,7.8792,NaN,S,153.0,NaN
895,high,사망,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,high,생존,"Dorking, Mr. Edward Arthur",male,19.0,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL"
897,high,생존,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [278]:
def survive_mdfy(x):
    if 10<=x<20 :
        return '10대'
    elif 20<=x<30:
        return '20대'
    elif 30<=x<40:
        return '30대'
    elif 40<=x<50:
        return '40대'
    elif 50<=x<60:
        return '50대'
    elif 60<=x<70:
        return '60대'
    else:
        return '그 외'
    
    
df['age'] = df['age'].apply(survive_mdfy)
# df[pclass]  = p_class_mdfy(df['pclass'])   
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,high,생존,"Mellinger, Miss. Madeleine Violet",female,10대,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,high,생존,"Wells, Miss. Joan",female,그 외,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,high,생존,"Duran y More, Miss. Florentina",female,30대,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,high,사망,"Scanlan, Mr. James",male,그 외,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,high,생존,"Bradley, Miss. Bridget Delia",female,20대,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,high,사망,"Davies, Mr. Joseph",male,10대,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI"
894,high,사망,"Lockyer, Mr. Edward",male,그 외,0,0,1222,7.8792,NaN,S,153.0,NaN
895,high,사망,"Fortune, Mr. Mark",male,60대,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,high,생존,"Dorking, Mr. Edward Arthur",male,10대,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL"
897,high,생존,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,20대,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [298]:
df2 = pd.read_csv('../csv-data/titanic_train.csv')
df2

def name_sex(x): 
    if 'Mr' in x or 'Dr' in x:
        return '남자'
    elif 'Miss' in x:
        return '여자'
    else:
        return '기타'
    
df2['name_result'] = df2['name'].apply(name_sex)
df2

df2['name_result'].value_counts()

남자    667
여자    177
기타     54
Name: name_result, dtype: int64

In [ ]:
#apply, map의 용도는 df의 컬럼의 값을 특정 처리 후, df의 컬럼으로 다시 갱신하거나 , 파생변수를 만들어 
#집어넣기 위한 것. 
# ==> apply, map의 함수로 사용되는 것은 입력값이 시리즈의 값 하나를 처리하는 단위로 만들어야 함. 
# ==> return 을 반드시 넣어서 함수로 만들어야 한다. 
#x는 시리즈(리스트)의 하나의 값을 처리하는 단위